---
kind: other
id: Methods.T:Autodesk.Revit.DB.Frame
source: html/70204b7c-190f-3147-b8f6-48e9d1863a6a.htm
---
# Frame Methods

Tests whether the supplied Frame object may be used to define a Revit curve or surface.
 In order to satisfy the requirements the Frame must be orthonormal
 and its origin is expected to lie within the Revit design limits IsWithinLengthLimits(XYZ) .